{
  "backend/main.mo": "Motoko canister managing candidates, enquiries, contact messages, file uploads, and authorization with timestamp sorting helpers.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend components, pages, and config files.",
  "frontend/index.css": "Tailwind base layer defining brand color variables, dark mode tokens, and global background/text defaults.",
  "frontend/index.html": "HTML entry point with SEO tags, social metadata, favicon, and script loader for the React app.",
  "frontend/public/robots.txt": "Robots file allowing all crawlers and linking to the sitemap.",
  "frontend/public/sitemap.xml": "Sitemap listing all major public routes with priorities and update frequencies.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public pages and protected admin dashboard using shared layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state, errors, and cache clearing.",
  "frontend/src/components/Brand/Logo.tsx": "Simple logo component rendering the static agency logo image.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with navigation links, contact info, legal links, and a branded copyright block.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout including top navigation, outlet content, footer, and WhatsApp button.",
  "frontend/src/components/layout/TopNav.tsx": "Implements responsive top navigation with links, logo, login button, and a mobile sidebar menu.",
  "frontend/src/components/SectionHeading.tsx": "Reusable heading component providing consistent H1/H2 typography.",
  "frontend/src/components/Seo.tsx": "Runtime SEO manager updating page title and meta tags on navigation.",
  "frontend/src/components/WhatsAppFloatingButton.tsx": "Floating WhatsApp action button linking to chat for the agency number.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and identity state.",
  "frontend/src/index.css": "Sets global Tailwind layers, theme variables, dark mode colors, and brand color utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with mission, vision, commitment cards, and agency background content.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page fetching candidates, enquiries, and messages, with filtering and delete actions via React Query and actor calls.",
  "frontend/src/pages/admin/AdminGuard.tsx": "Auth guard that checks Internet Identity login and admin status before rendering admin content, showing appropriate alerts when blocked.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact forms for candidates and clients, submitting messages via the backend actor with success handling.",
  "frontend/src/pages/HandymanRegistrationPage.tsx": "Form page allowing candidates to register and upload documents, using mutations to submit data and track upload progress.",
  "frontend/src/pages/HireHandymanPage.tsx": "Client enquiry form that submits hiring requests via a mutation and displays success feedback.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero content, contact info, operating locations, and links to registration and hiring pages.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page outlining data collection, usage, and security practices.",
  "frontend/src/pages/ServicesPage.tsx": "Describes recruitment services offered to clients and candidates, including sourcing, screening, and placement.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, persisting them in sessionStorage, and clearing parameters from hashes.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme colors, fonts, animations, plugins, and content paths.",
  "project_state.json": "Project metadata describing features, requirements, architecture notes, and current site implementation scope."
}